app/controllers/api/courses_controller.rb

SELECT "courses".* FROM "courses" WHERE "courses"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
---
    def show
        course = Course.find(params[:id])
        return (render status: :unprocessable_entity) if !course

        render json: {
            title:  course.title,
            description: course.description,
            fio: User.find(course.user_id).fio,
            number_of_students: Course.sum_students(params[:id])

SELECT "courses".* FROM "courses" WHERE "courses"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "participants".* FROM "participants" WHERE "participants"."user_id" = ? AND "participants"."course_id" = ? LIMIT ?  [["user_id", 4], ["course_id", 6], ["LIMIT", 1]]
INSERT INTO "participants" ("user_id", "course_id", "created_at", "updated_at") VALUES (?, ?, ?, ?) RETURNING "id"  [["user_id", 4], ["course_id", 6], ["created_at", "2024-04-06 09:18:38.536588"], ["updated_at", "2024-04-06 09:18:38.536588"]]
---
    def subscribe
        return (render status: :forbidden) if @user.teacher

        course = Course.find(params[:course_id])
        return (render status: :unprocessable_entity) if !course
        return (render status: :unprocessable_entity) if Participant.find_by(:user => @user, :course => course)

        participant = Participant.new(:user => @user, :course => course)
        participant.save

INSERT INTO "courses" ("title", "description", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?) RETURNING "id"  [["title", "Хуевый курс"], ["description", "Самый хуевый курс на этом свете"], ["user_id", 2], ["created_at", "2024-04-05 17:30:45.002163"], ["updated_at", "2024-04-05 17:30:45.002163"]]
SELECT users.fio, courses.title, courses.description, courses.id FROM "courses" INNER JOIN "users" ON "users"."id" = "courses"."user_id" WHERE "courses"."user_id" = ? LIMIT ? OFFSET ?  [["user_id", 5], ["LIMIT", 2], ["OFFSET", 0]]
---
    def create
        return (render status: :bad_request) if !check_course_params
        return (render status: :forbidden) if !@user.teacher

        @course = Course.new(:title => course_params[:title], :description => course_params[:description], :user => @user)
        @course.save
        render json: {
            "id": @course.id,
            "title": @course.title,
            "description": @course.description,
            "fio": @user.fio
        }, status: :ok
    end


    private def get_courses(filters)
        pagin_offset = (filters[:pagination][:page] - 1) * filters[:pagination][:limit]

        if (filters[:id_stud] != 0) and (filters[:id_teach] != 0)
            courses = Course.select("users.fio, courses.title, courses.description, courses.id").where(user_id: filters[:id_teach]).joins(:participants).where("participants.user_id" => filters[:id_stud]).joins(:user).offset(pagin_offset).take(filters[:pagination][:limit])
        elsif (filters[:id_stud] != 0)
            courses = Course.select("users.fio, courses.title, courses.description, courses.id").joins(:participants).where("participants.user_id" => filters[:id_stud]).joins(:user).offset(pagin_offset).take(filters[:pagination][:limit])
        elsif (filters[:id_teach] != 0)
            courses = Course.select("users.fio, courses.title, courses.description, courses.id").where(user_id: filters[:id_teach]).joins(:user).offset(pagin_offset).take(filters[:pagination][:limit])
        else
            courses = Course.select("users.fio, courses.title, courses.description, courses.id").joins(:user).offset(pagin_offset).take(filters[:pagination][:limit])

SELECT "users".* FROM "users" WHERE "users"."id" = ? AND "users"."jwt_validation" = ? LIMIT ?  [["id", 2], ["jwt_validation", "RyyicdVaDKCsQDlnFHYLmNShljEYoxAQ"], ["LIMIT", 1]]
---
            return (render status: :unauthorized)
        end

        @user = User.find_by(id: decoded_token[0]["id"], jwt_validation: decoded_token[0]["jwt_validation"])