app/controllers/api/courses_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = ? AND "users"."jwt_validation" IS NULL LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
            return (render status: :unauthorized)
        end

        @user = User.find_by(id: decoded_token[0]["id"], jwt_validation: decoded_token[0]["jwt_validation"])