app/controllers/api/reg_controller.rb

    def create
      unless check_params
        render json: { error: 'Bad request' }, status: :bad_request
        return
      end

      @user = User.new(fio: user_params[:fio], email: user_params[:email],
                       password: BCrypt::Password.create(user_params[:password]),
                       teacher: user_params[:teacher], jwt_validation: random_string(32))
---
INSERT INTO "users" ("fio", "email", "password", "teacher", "jwt_validation", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?) RETURNING "id"