app/controllers/api/session_controller.rb

    def destroy
        return (render status: :unauthorized) if !check_token

        token = request.headers['Authorization'][7..-1]
        begin
            decoded_token = JWT.decode token, nil, false
        rescue JWT::DecodeError
            return (render status: :unauthorized)
        end

        user = User.find_by(id: decoded_token[0]["id"], jwt_validation: decoded_token[0]["jwt_validation"])
        return (render status: :unprocessable_entity) if !user

        user.jwt_validation = get_random_string(32)
        user.save
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? AND "users"."jwt_validation" IS NULL LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "jwt_validation" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["jwt_validation", "kcFuGjyZydAOaZsioSchuMklaTqRefwr"], ["updated_at", "2024-04-05 23:23:37.742569"], ["id", 1]]