app/controllers/api/session_controller.rb

    def create
        return (render status: 400) if !check_params

        user = User.find_by(email: user_params[:email])
---
SELECT "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "stu@gmail.com"], ["LIMIT", 1]]