app/models/course.rb

SELECT COUNT(*) FROM "courses" INNER JOIN "participants" ON "participants"."course_id" = "courses"."id" WHERE "participants"."course_id" = ?  [["course_id", nil]]
---
  scope :sum_students, -> (id){where(id: id).joins(:participants).count}